CSI API ETABS v1
cCaseModalEigen.GetNumberModes Method
 This function retrieves the number of modes requested for the specified load case.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNumberModes(
	string Name,
	ref int MaxModes,
	ref int MinModes
)
Function GetNumberModes (
	Name As String,
	ByRef MaxModes As Integer,
	ByRef MinModes As Integer
) As Integer
Dim instance As cCaseModalEigen
Dim Name As String
Dim MaxModes As Integer
Dim MinModes As Integer
Dim returnValue As Integer
returnValue = instance.GetNumberModes(Name,
	MaxModes, MinModes)
int GetNumberModes(
	String^ Name,
	int% MaxModes,
	int% MinModes
)
abstract GetNumberModes :
        Name : string *
        MaxModes : int byref *
        MinModes : int byref -> int
Parameters
Name
Type: System.String
 The name of an existing modal Eigen load case.
MaxModes
Type: System.Int32
 The maximum number of modes requested.
MinModes
Type: System.Int32
 The minimum number of modes requested.
Return Value
Type: Int32
 The function returns zero if the number of modes is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim MaxModes As Integer
   Dim MinModes As Integer
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add modal Eigen load case
    ret = SapModel.LoadCases.ModalEigen.SetCase("LCASE1")
'get load data
   ret = mySapModel.LoadCases.ModalEigen.GetNumberModes("LCASE1", MaxModes, MinModes)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseModalEigen Interface
ETABSv1 Namespace